{
    "n64": {
        "containers": [
            { "id": "n64-hc-1", "name": "Odolwa's Remains", "found": false },
            { "id": "n64-hc-2", "name": "Goht's Remains", "found": false },
            { "id": "n64-hc-3", "name": "Gyorg's Remains", "found": false },
            { "id": "n64-hc-4", "name": "Twinmold's Remains", "found": false }
        ],
        "pieces": [
            { "id": "n64-p-1", "location": "South Clock Town", "description": "Trade the Moon's Tear to the Business Scrub, then use the Deku Flower to launch to the Clock Tower's ledge.", "walkthrough": "First, get the Moon's Tear from the Observatory. Then, find the Business Scrub in South Clock Town. As Deku Link, give him the Moon's Tear to get the Town Land Title Deed. Use the newly acquired Deku Flower to fly up to the ledge on the Clock Tower.", "found": false },
            { "id": "n64-p-2", "location": "North Clock Town", "description": "In a tree near the slide.", "walkthrough": "In North Clock Town, there is a large tree next to the slide where the kids play. The Piece of Heart is sitting on one of the branches. Simply climb the tree to get it.", "found": false },
            { "id": "n64-p-3", "location": "North Clock Town", "description": "Win the Deku Scrub's playground game three days in a row.", "walkthrough": "As Deku Link, jump into the fenced-in area in North Clock Town. Talk to the Deku Scrub to play a game. You must successfully fly from platform to platform and land on the main one. Win the game on all three days to get the Piece of Heart.", "found": false },
            { "id": "n64-p-4", "location": "North Clock Town", "description": "Answer the Keaton's quiz correctly while wearing the Keaton Mask.", "walkthrough": "Wear the Keaton Mask and cut down the moving bushes in North Clock Town. A Keaton will appear. Answer his five questions correctly to receive a Piece of Heart. The questions are random, so you may need to try a few times.", "found": false },
            { "id": "n64-p-5", "location": "East Clock Town", "description": "Score a perfect 50 at the Shooting Gallery.", "walkthrough": "Go to the Town Shooting Gallery in East Clock Town. You must get a perfect score of 50, meaning you must hit every single Octorok that appears. If you succeed, you'll be rewarded with a Piece of Heart.", "found": false },
            { "id": "n64-p-6", "location": "East Clock Town", "description": "Win Honey & Darling's games for three consecutive days.", "walkthrough": "Visit Honey & Darling's Shop in East Clock Town each day and win the mini-game. The game changes each day. You must win all three days in a single three-day cycle. This requires the Bow, Bombs, and potentially other items depending on the game.", "found": false },
            { "id": "n64-p-7", "location": "East Clock Town", "description": "Listen to the first of Anju's grandmother's stories with the All-Night Mask.", "walkthrough": "Go to the Stock Pot Inn's library on the first or second day between 8am and 6pm. Wear the All-Night Mask and listen to the story 'Carnival of Time' from Anju's Grandmother. When she asks a question, answer 'On the eve of the carnival' to get a Piece of Heart.", "found": false },
            { "id": "n64-p-8", "location": "East Clock Town", "description": "Listen to the second of Anju's grandmother's stories with the All-Night Mask.", "walkthrough": "Go to the Stock Pot Inn's library on the first or second day between 8am and 6pm. Wear the All-Night Mask and listen to the story 'The Four Giants'. When she asks a question, answer 'I dunno' to get a Piece of Heart.", "found": false },
            { "id": "n64-p-9", "location": "East Clock Town", "description": "With the Couple's Mask, speak to the Mayor in his office.", "walkthrough": "After completing the long Anju and Kafei side quest to get the Couple's Mask, go to the Mayor's Residence in East Clock Town. Wear the Couple's Mask and speak to Mayor Dotour to end the eternal meeting and receive a Piece of Heart.", "found": false },
            { "id": "n64-p-10", "location": "East Clock Town", "description": "Give a piece of paper (like a Title Deed) to the hand in the toilet at the Stock Pot Inn at night.", "walkthrough": "Between midnight and 6am, go to the toilet in the Stock Pot Inn. A mysterious hand named '???' will come out. Give it any piece of paper (a Title Deed, a letter, etc.) to receive a Piece of Heart.", "found": false },
            { "id": "n64-p-11", "location": "West Clock Town", "description": "Complete the Swordsman's advanced course.", "walkthrough": "Go to the Swordsman's School in West Clock Town. Pay 10 rupees to take the expert course. You must score a perfect 30 by destroying all logs with jump attacks. A Piece of Heart is your reward.", "found": false },
            { "id": "n64-p-12", "location": "West Clock Town", "description": "Play the Postman's timing game and stop the clock at exactly 10 seconds.", "walkthrough": "Go to the Post Office in West Clock Town. Speak to the Postman and agree to play his timing game. You need to start a timer and stop it at exactly 10 seconds. Wearing the Bunny Hood makes it easier to see the timer.", "found": false },
            { "id": "n64-p-13", "location": "West Clock Town", "description": "Wear Kamaro's Mask and dance with the Rosa Sisters at night.", "walkthrough": "Find Kamaro in Termina Field at night, on one of the mushroom-shaped rocks. Play the Song of Healing for him to get Kamaro's Mask. Then, go to West Clock Town at night and perform the dance for the Rosa Sisters. They will give you a Piece of Heart.", "found": false },
            { "id": "n64-p-14", "location": "West Clock Town", "description": "Deposit 5,000 Rupees at the bank.", "walkthrough": "The Clock Town bank is located in South Clock Town, but the banker moves to West Clock Town after the first day. Deposit a total of 5,000 rupees into your account. You don't have to do it all at once. The banker will reward your loyalty with a Piece of Heart.", "found": false },
            { "id": "n64-p-15", "location": "West Clock Town", "description": "Check a mailbox while wearing the Postman's Hat.", "walkthrough": "After obtaining the Postman's Hat from the Anju and Kafei side quest, wear it and check any mailbox in Clock Town. The first one you check will have a Piece of Heart inside.", "found": false },
            { "id": "n64-p-16", "location": "Termina Field", "description": "In a hole near the entrance to Milk Road, defeat the Peahat.", "walkthrough": "In the southwest corner of Termina Field, near the entrance to Milk Road, there's a patch of grass. Drop into the hole hidden there and defeat the large Peahat inside to make a chest with the Heart Piece appear.", "found": false },
            { "id": "n64-p-17", "location": "Termina Field", "description": "In a grotto near the Great Bay entrance, bomb a rock, shoot down a beehive, and dive as Zora Link.", "walkthrough": "West of the entrance to Great Bay in Termina Field, there is a large boulder. Bomb it to reveal a hidden grotto. Inside, shoot down the beehive from the ceiling, then dive down as Zora Link to collect the Piece of Heart at the bottom of the water.", "found": false },
            { "id": "n64-p-18", "location": "Termina Field", "description": "In a grotto near the four Gossip Stones, play the corresponding song for each transformation mask.", "walkthrough": "Find the grotto in Termina Field with four Gossip Stones. You need to stand in front of the large Gossip Stone and play the correct song for each of your transformation forms. Play the Deku Prelude as Deku Link, the Goron Lullaby as Goron Link, and the New Wave Bossa Nova as Zora Link. The stone will turn the color of the corresponding form. Once all are played, you'll get a Piece of Heart.", "found": false },
            { "id": "n64-p-19", "location": "Termina Field", "description": "In a grotto near the observatory, buy a heart piece from a Business Scrub for 150 rupees (or 100 with a discount).", "walkthrough": "Fly over the fence to the Astral Observatory as Deku Link. Drop into the hole there. Use the Lens of Truth to see the Business Scrub. He will sell you a Piece of Heart for 150 rupees. If you have the Kafei's Mask, he will give you a discount and sell it for 100 rupees.", "found": false },
            { "id": "n64-p-20", "location": "Termina Field", "description": "In a grotto with two Dodongos, defeat them to make a chest appear.", "walkthrough": "In North Termina Field, near the entrance to the snowy area, there is a hole. Drop down and defeat the two Dodongos inside. A chest containing a Piece of Heart will appear.", "found": false },
            { "id": "n64-p-21", "location": "Southern Swamp", "description": "On top of the Swamp Tourist Center. Trade the Land Title Deed to the Business Scrub and use the flower.", "walkthrough": "After getting the Town Land Title Deed from the Business Scrub in Clock Town, find the Business Scrub in the Southern Swamp. Trade him the deed for the Swamp Title Deed. Use the Deku Flower he was guarding to fly onto the roof of the Swamp Tourist Center to get the Piece of Heart.", "found": false },
            { "id": "n64-p-22", "location": "Southern Swamp", "description": "Win the Swamp Shooting Gallery game.", "walkthrough": "The Swamp Shooting Gallery is located on the road to the Deku Palace. You need to score over 2,120 points. It's a gallery where you shoot at various monsters. A perfect round will get you the Piece of Heart.", "found": false },
            { "id": "n64-p-23", "location": "Southern Swamp", "description": "Take a picture of the Deku King and win the photo contest.", "walkthrough": "After you've rescued Koume, you can enter the Swamp Tourist Center. The man inside is holding a photo contest. You need to bring him a picture of the Deku King. Sneak into the Deku Palace, take a picture of the king, and bring it back to the man to win a Piece of Heart.", "found": false },
            { "id": "n64-p-24", "location": "Deku Palace", "description": "Navigate the inner garden maze to the right side.", "walkthrough": "Inside the Deku Palace, there are two gardens that are being patrolled by guards. You need to sneak through the right-hand garden without being caught. At the end of the maze, you will find a Piece of Heart.", "found": false },
            { "id": "n64-p-25", "location": "Woodfall", "description": "In a chest on a tree on the path to the Woodfall Temple.", "walkthrough": "In the Woodfall area, there are a series of platforms and trees leading to the temple. The Piece of Heart is in a chest on one of these platforms. You'll need to use the Deku Flowers to fly from platform to platform to reach it.", "found": false },
            { "id": "n64-p-26", "location": "Road to Southern Swamp", "description": "Climb a tall tree on the road to the swamp.", "walkthrough": "On the path from Termina Field to the Southern Swamp, there is a very large, tall tree. The Piece of Heart is at the very top. You'll need to climb the vines to reach it.", "found": false },
            { "id": "n64-p-27", "location": "Southern Swamp", "description": "After clearing Woodfall Temple, win Koume's boat cruise shooting game. This awards a Piece of Heart in the N64 version.", "walkthrough": "After you've cleared the Woodfall Temple, Koume will offer a boat cruise that includes a shooting game. Hit the target at least 20 times to win a Piece of Heart.", "found": false },
            { "id": "n64-p-28", "location": "Mountain Village", "description": "After clearing Snowhead Temple, dive into the thawed pond as Zora Link.", "walkthrough": "Once you've defeated Goht and brought spring back to the mountains, the pond in the Mountain Village will thaw. Dive to the bottom as Zora Link to find a Piece of Heart.", "found": false },
            { "id": "n64-p-29", "location": "Mountain Village", "description": "Gather all five frogs and perform the frog choir with Don Gero's Mask.", "walkthrough": "You need to find five frogs scattered across Termina and speak to them while wearing the Don Gero's Mask. The frogs are in Clock Town (laundry pool), Southern Swamp (on a log), Woodfall Temple (mini-boss room), Great Bay Temple (mini-boss room), and on a log in the river in the thawed Mountain Village. Once you've spoken to all of them, return to the Mountain Village pond and conduct the choir to get a Piece of Heart.", "found": false },
            { "id": "n64-p-30", "location": "Road to Snowhead", "description": "Use the Scarecrow's Song, Hookshot, and Lens of Truth to reach a chest.", "walkthrough": "On the path to Snowhead, there's a large gap with two pillars. Play the Scarecrow's Song on the edge of the cliff. Use the Lens of Truth to see some invisible ice platforms. Jump across them and Hookshot to the scarecrow, then to the chest containing the Piece of Heart.", "found": false },
            { "id": "n64-p-31", "location": "Goron Village", "description": "Trade the Swamp Title Deed to the Business Scrub and use the Deku Flower.", "walkthrough": "After getting the Swamp Title Deed, find the Business Scrub in Goron Village. As Deku Link, trade him the deed for the Mountain Title Deed. Use the Deku Flower he was on to fly to a ledge with a Piece of Heart.", "found": false },
            { "id": "n64-p-32", "location": "Romani Ranch", "description": "Win 150 rupees or more at the dog races by using the Mask of Truth to pick a winning dog.", "walkthrough": "Go to the Doggy Racetrack at Romani Ranch. Wear the Mask of Truth to read the dogs' minds and pick the one that feels confident. Bet 50 rupees on it. If your dog wins and you get a payout of 150 rupees or more, you'll receive a Piece of Heart.", "found": false },
            { "id": "n64-p-33", "location": "Oceanside Spider House", "description": "Clear the spider house of all 30 Gold Skulltulas.", "walkthrough": "On the Great Bay Coast, enter the Oceanside Spider House. You must find and kill all 30 Gold Skulltulas within the first day to break the curse. The man inside will give you a Piece of Heart as a reward.", "found": false },
            { "id": "n64-p-34", "location": "Pinnacle Rock", "description": "Rescue the seahorse by taking a picture of a pirate and showing it to the fisherman. The seahorse will then guide you through Pinnacle Rock.", "walkthrough": "Get an empty bottle and go to the Pirates' Fortress. Take a picture of a Gerudo Pirate. Show the picture to the fisherman on the coast to get a seahorse. Take the seahorse to Pinnacle Rock. It will guide you through the murky water to a cave where two other seahorses are trapped. Defeat the Deep Pythons to free them, and they will give you a Piece of Heart.", "found": false },
            { "id": "n64-p-35", "location": "Zora Cape", "description": "In the Zora Hall, play your ocarina for the Zora in Japas' room to have him write a song.", "walkthrough": "As Zora Link, go into Japas' room in the Zora Hall. He will start playing a bass riff. Pull out your ocarina and he will jam with you, creating a song. Play the song back to him. Then, go to Evan's room and play the same song as Link. Evan will be inspired and give you a Piece of Heart.", "found": false },
            { "id": "n64-p-36", "location": "Zora Cape", "description": "In the Zora Game Site, catch all the fish.", "walkthrough": "Go to the Zora Game Site on the coast. Pay 20 rupees to play. You need to jump into the water and catch the two 'good' fish that the Zora throws in. They are the orange and blue ones. Bring them back to him to win a Piece of Heart.", "found": false },
            { "id": "n64-p-37", "location": "Great Bay Coast", "description": "On the islands to the west, use the Hookshot to get to a chest.", "walkthrough": "On the western side of the Great Bay Coast, there are several small islands. Use the Hookshot to grapple from one palm tree to the next until you reach the island with a chest containing a Piece of Heart.", "found": false },
            { "id": "n64-p-38", "location": "Pirate's Fortress", "description": "Get the Hookshot and use it to get to a chest in the main chamber.", "walkthrough": "Inside the main chamber of the Pirates' Fortress, there is a high ledge with a chest. You need the Hookshot to grapple onto a wooden beam and reach the chest, which contains a Piece of Heart.", "found": false },
            { "id": "n64-p-39", "location": "Great Bay Coast", "description": "In the Beaver's Racetrack, beat both beavers twice.", "walkthrough": "Up the river in Zora Cape, you'll find the Beaver Racetrack. As Zora Link, you need to race and beat both beavers. After beating the first one, you get a bottle. Beat him again, and then his older brother will challenge you. Beat the older brother to get a Piece of Heart.", "found": false },
            { "id": "n64-p-40", "location": "Zora Hall", "description": "Play the New Wave Bossa Nova to Lulu, then go to the Zora Hall and listen to the band members' soundcheck.", "walkthrough": "After you've learned the New Wave Bossa Nova and returned Lulu's voice, go to the Zora Hall. The band will be practicing. Listen to their soundcheck to get a Piece of Heart.", "found": false },
            { "id": "n64-p-41", "location": "Great Bay Temple", "description": "Defeat the Gekko mini-boss.", "walkthrough": "Inside the Great Bay Temple, you will fight a Gekko mini-boss. Defeat it to reveal a chest containing a Piece of Heart.", "found": false },
            { "id": "n64-p-42", "location": "Ikana Canyon", "description": "On the roof of Ikana Castle, shoot a switch and use the Deku Flowers to fly to a pillar.", "walkthrough": "Once you reach the roof of Ikana Castle, look for a crystal switch on a pillar. Shoot it with an arrow. This will extinguish the flames on another pillar, revealing a Deku Flower. Use the Deku Flowers to fly over to the pillar with the Piece of Heart.", "found": false },
            { "id": "n64-p-43", "location": "Ancient Castle of Ikana", "description": "Hit a crystal switch in the throne room.", "walkthrough": "In the throne room of the Ancient Castle of Ikana, stand on one of the pillars and shoot the crystal switch on the other side of the room. This will cause a Piece of Heart to appear on the other pillar.", "found": false },
            { "id": "n64-p-44", "location": "Stone Tower", "description": "On a ledge.", "walkthrough": "In the Stone Tower area, before you enter the temple, there is a series of ledges you can reach by using the Elegy of Emptiness to create statues to hold down switches. One of these ledges holds a Piece of Heart.", "found": false },
            { "id": "n64-p-45", "location": "Secret Shrine", "description": "In a Secret Shrine, defeat the four bosses again.", "walkthrough": "In Ikana Canyon, there is a Secret Shrine that can only be accessed once you have 16 or more heart containers. Inside, you must fight the four main bosses again. Defeating them all will reward you with a Piece of Heart.", "found": false },
            { "id": "n64-p-46", "location": "Ikana Canyon", "description": "Trade the Ocean Title Deed to the Business Scrub near Sakon's Hideout.", "walkthrough": "After getting the Ocean Title Deed from the Zora Hall, find the Business Scrub in Ikana Canyon near Sakon's Hideout. As Zora Link, trade him the deed for 200 rupees and the use of his Deku Flower. Use it to fly to a ledge with a Piece of Heart.", "found": false },
            { "id": "n64-p-47", "location": "Ikana Graveyard", "description": "On the final night, have Dampe dig up the grave to find an Empty Bottle. The Piece of Heart is found elsewhere in the 3DS version.", "walkthrough": "In the Ikana Graveyard on the final night, wear the Captain's Hat and order the Stalchildren to open the grave. Inside, lead Dampe through the tunnels. He will dig up an Empty Bottle.", "found": false },
            { "id": "n64-p-48", "location": "The Moon", "description": "Complete the Deku Scrub mini-dungeon.", "walkthrough": "On the Moon, give one mask to the child wearing Odolwa's mask. Enter the Deku Scrub-themed dungeon and navigate the maze to the end to find a Piece of Heart.", "found": false },
            { "id": "n64-p-49", "location": "The Moon", "description": "Complete the Goron mini-dungeon.", "walkthrough": "On the Moon, give two masks to the child wearing Goht's mask. Enter the Goron-themed dungeon and roll your way to the end to find a Piece of Heart.", "found": false },
            { "id": "n64-p-50", "location": "The Moon", "description": "Complete the Zora mini-dungeon. The correct path is Left, Left, Right, Left.", "walkthrough": "On the Moon, give three masks to the child wearing Gyorg's mask. Enter the Zora-themed dungeon. Swim through the currents in the correct sequence (Left, Left, Right, Left) to reach the end and find a Piece of Heart.", "found": false },
            { "id": "n64-p-51", "location": "The Moon", "description": "Complete the Link mini-dungeon.", "walkthrough": "On the Moon, give four masks to the child wearing Twinmold's mask. Enter the Link-themed dungeon, which is a series of combat rooms. Defeat all the enemies to get a Piece of Heart.", "found": false }
        ]
    },
    "3ds": {
        "containers": [
            { "id": "3ds-hc-1", "name": "Odolwa's Remains", "found": false },
            { "id": "3ds-hc-2", "name": "Goht's Remains", "found": false },
            { "id": "3ds-hc-3", "name": "Gyorg's Remains", "found": false },
            { "id": "3ds-hc-4", "name": "Twinmold's Remains", "found": false }
        ],
        "pieces": [
            { "id": "3ds-p-1", "location": "South Clock Town", "description": "Trade the Moon's Tear to the Business Scrub, then use the Deku Flower to launch to the Clock Tower's ledge.", "walkthrough": "First, get the Moon's Tear from the Observatory. Then, find the Business Scrub in South Clock Town. As Deku Link, give him the Moon's Tear to get the Town Land Title Deed. Use the newly acquired Deku Flower to fly up to the ledge on the Clock Tower.", "found": false },
            { "id": "3ds-p-2", "location": "North Clock Town", "description": "In a tree near the slide.", "walkthrough": "In North Clock Town, there is a large tree next to the slide where the kids play. The Piece of Heart is sitting on one of the branches. Simply climb the tree to get it.", "found": false },
            { "id": "3ds-p-3", "location": "North Clock Town", "description": "Win the Deku Scrub's playground game three days in a row.", "walkthrough": "As Deku Link, jump into the fenced-in area in North Clock Town. Talk to the Deku Scrub to play a game. You must successfully fly from platform to platform and land on the main one. Win the game on all three days to get the Piece of Heart.", "found": false },
            { "id": "3ds-p-4", "location": "North Clock Town", "description": "Answer the Keaton's quiz correctly while wearing the Keaton Mask.", "walkthrough": "Wear the Keaton Mask and cut down the moving bushes in North Clock Town. A Keaton will appear. Answer his five questions correctly to receive a Piece of Heart. The questions are random, so you may need to try a few times.", "found": false },
            { "id": "3ds-p-5", "location": "East Clock Town", "description": "Score a perfect 50 at the Shooting Gallery.", "walkthrough": "Go to the Town Shooting Gallery in East Clock Town. You must get a perfect score of 50, meaning you must hit every single Octorok that appears. If you succeed, you'll be rewarded with a Piece of Heart.", "found": false },
            { "id": "3ds-p-6", "location": "East Clock Town", "description": "Win Honey & Darling's games for three consecutive days.", "walkthrough": "Visit Honey & Darling's Shop in East Clock Town each day and win the mini-game. The game changes each day. You must win all three days in a single three-day cycle. This requires the Bow, Bombs, and potentially other items depending on the game.", "found": false },
            { "id": "3ds-p-7", "location": "East Clock Town", "description": "Listen to the first of Anju's grandmother's stories with the All-Night Mask.", "walkthrough": "Go to the Stock Pot Inn's library on the first or second day between 8am and 6pm. Wear the All-Night Mask and listen to the story 'Carnival of Time' from Anju's Grandmother. When she asks a question, answer 'On the eve of the carnival' to get a Piece of Heart.", "found": false },
            { "id": "3ds-p-8", "location": "East Clock Town", "description": "Listen to the second of Anju's grandmother's stories with the All-Night Mask.", "walkthrough": "Go to the Stock Pot Inn's library on the first or second day between 8am and 6pm. Wear the All-Night Mask and listen to the story 'The Four Giants'. When she asks a question, answer 'I dunno' to get a Piece of Heart.", "found": false },
            { "id": "3ds-p-9", "location": "East Clock Town", "description": "With the Couple's Mask, speak to the Mayor in his office.", "walkthrough": "After completing the long Anju and Kafei side quest to get the Couple's Mask, go to the Mayor's Residence in East Clock Town. Wear the Couple's Mask and speak to Mayor Dotour to end the eternal meeting and receive a Piece of Heart.", "found": false },
            { "id": "3ds-p-10", "location": "East Clock Town", "description": "Give a piece of paper (like a Title Deed) to the hand in the toilet at the Stock Pot Inn at night.", "walkthrough": "Between midnight and 6am, go to the toilet in the Stock Pot Inn. A mysterious hand named '???' will come out. Give it any piece of paper (a Title Deed, a letter, etc.) to receive a Piece of Heart.", "found": false },
            { "id": "3ds-p-11", "location": "West Clock Town", "description": "Complete the Swordsman's advanced course.", "walkthrough": "Go to the Swordsman's School in West Clock Town. Pay 10 rupees to take the expert course. You must score a perfect 30 by destroying all logs with jump attacks. A Piece of Heart is your reward.", "found": false },
            { "id": "3ds-p-12", "location": "West Clock Town", "description": "Play the Postman's timing game and stop the clock at exactly 10 seconds.", "walkthrough": "Go to the Post Office in West Clock Town. Speak to the Postman and agree to play his timing game. You need to start a timer and stop it at exactly 10 seconds. Wearing the Bunny Hood makes it easier to see the timer.", "found": false },
            { "id": "3ds-p-13", "location": "West Clock Town", "description": "Wear Kamaro's Mask and dance with the Rosa Sisters at night.", "walkthrough": "Find Kamaro in Termina Field at night, on one of the mushroom-shaped rocks. Play the Song of Healing for him to get Kamaro's Mask. Then, go to West Clock Town at night and perform the dance for the Rosa Sisters. They will give you a Piece of Heart.", "found": false },
            { "id": "3ds-p-14", "location": "West Clock Town", "description": "Deposit 5,000 Rupees at the bank.", "walkthrough": "The Clock Town bank is located in South Clock Town, but the banker moves to West Clock Town after the first day. Deposit a total of 5,000 rupees into your account. You don't have to do it all at once. The banker will reward your loyalty with a Piece of Heart.", "found": false },
            { "id": "3ds-p-15", "location": "West Clock Town", "description": "Check a mailbox while wearing the Postman's Hat.", "walkthrough": "After obtaining the Postman's Hat from the Anju and Kafei side quest, wear it and check any mailbox in Clock Town. The first one you check will have a Piece of Heart inside.", "found": false },
            { "id": "3ds-p-16", "location": "Termina Field", "description": "In a hole near the entrance to Milk Road, defeat the Peahat.", "walkthrough": "In the southwest corner of Termina Field, near the entrance to Milk Road, there's a patch of grass. Drop into the hole hidden there and defeat the large Peahat inside to make a chest with the Heart Piece appear.", "found": false },
            { "id": "3ds-p-17", "location": "Termina Field", "description": "In a grotto near the Great Bay entrance, bomb a rock, shoot down a beehive, and dive as Zora Link.", "walkthrough": "West of the entrance to Great Bay in Termina Field, there is a large boulder. Bomb it to reveal a hidden grotto. Inside, shoot down the beehive from the ceiling, then dive down as Zora Link to collect the Piece of Heart at the bottom of the water.", "found": false },
            { "id": "3ds-p-18", "location": "Termina Field", "description": "In a grotto near the four Gossip Stones, play the corresponding song for each transformation mask.", "walkthrough": "Find the grotto in Termina Field with four Gossip Stones. You need to stand in front of the large Gossip Stone and play the correct song for each of your transformation forms. Play the Deku Prelude as Deku Link, the Goron Lullaby as Goron Link, and the New Wave Bossa Nova as Zora Link. The stone will turn the color of the corresponding form. Once all are played, you'll get a Piece of Heart.", "found": false },
            { "id": "3ds-p-19", "location": "Termina Field", "description": "In a grotto near the observatory, buy a heart piece from a Business Scrub for 150 rupees (or 100 with a discount).", "walkthrough": "Fly over the fence to the Astral Observatory as Deku Link. Drop into the hole there. Use the Lens of Truth to see the Business Scrub. He will sell you a Piece of Heart for 150 rupees. If you have the Kafei's Mask, he will give you a discount and sell it for 100 rupees.", "found": false },
            { "id": "3ds-p-20", "location": "Termina Field", "description": "In a grotto with two Dodongos, defeat them to make a chest appear.", "walkthrough": "In North Termina Field, near the entrance to the snowy area, there is a hole. Drop down and defeat the two Dodongos inside. A chest containing a Piece of Heart will appear.", "found": false },
            { "id": "3ds-p-21", "location": "Southern Swamp", "description": "On top of the Swamp Tourist Center. Trade the Land Title Deed to the Business Scrub and use the flower.", "walkthrough": "After getting the Town Land Title Deed from the Business Scrub in Clock Town, find the Business Scrub in the Southern Swamp. Trade him the deed for the Swamp Title Deed. Use the Deku Flower he was guarding to fly onto the roof of the Swamp Tourist Center to get the Piece of Heart.", "found": false },
            { "id": "3ds-p-22", "location": "Southern Swamp", "description": "Win the Swamp Shooting Gallery game.", "walkthrough": "The Swamp Shooting Gallery is located on the road to the Deku Palace. You need to score over 2,120 points. It's a gallery where you shoot at various monsters. A perfect round will get you the Piece of Heart.", "found": false },
            { "id": "3ds-p-23", "location": "Southern Swamp", "description": "Take a picture of the Deku King and win the photo contest.", "walkthrough": "After you've rescued Koume, you can enter the Swamp Tourist Center. The man inside is holding a photo contest. You need to bring him a picture of the Deku King. Sneak into the Deku Palace, take a picture of the king, and bring it back to the man to win a Piece of Heart.", "found": false },
            { "id": "3ds-p-24", "location": "Deku Palace", "description": "Navigate the inner garden maze to the right side.", "walkthrough": "Inside the Deku Palace, there are two gardens that are being patrolled by guards. You need to sneak through the right-hand garden without being caught. At the end of the maze, you will find a Piece of Heart.", "found": false },
            { "id": "3ds-p-25", "location": "Woodfall", "description": "In a chest on a tree on the path to the Woodfall Temple.", "walkthrough": "In the Woodfall area, there are a series of platforms and trees leading to the temple. The Piece of Heart is in a chest on one of these platforms. You'll need to use the Deku Flowers to fly from platform to platform to reach it.", "found": false },
            { "id": "3ds-p-26", "location": "Road to Southern Swamp", "description": "Climb a tall tree on the road to the swamp.", "walkthrough": "On the path from Termina Field to the Southern Swamp, there is a very large, tall tree. The Piece of Heart is at the very top. You'll need to climb the vines to reach it.", "found": false },
            { "id": "3ds-p-27", "location": "Southern Swamp", "description": "After clearing Woodfall Temple, win Koume's boat cruise shooting game. This awards an Empty Bottle in the 3DS version.", "walkthrough": "After you've cleared the Woodfall Temple, Koume will offer a boat cruise that includes a shooting game. Hit the target at least 20 times to win an Empty Bottle.", "found": false },
            { "id": "3ds-p-28", "location": "Mountain Village", "description": "After clearing Snowhead Temple, dive into the thawed pond as Zora Link.", "walkthrough": "Once you've defeated Goht and brought spring back to the mountains, the pond in the Mountain Village will thaw. Dive to the bottom as Zora Link to find a Piece of Heart.", "found": false },
            { "id": "3ds-p-29", "location": "Mountain Village", "description": "Gather all five frogs and perform the frog choir with Don Gero's Mask.", "walkthrough": "You need to find five frogs scattered across Termina and speak to them while wearing the Don Gero's Mask. The frogs are in Clock Town (laundry pool), Southern Swamp (on a log), Woodfall Temple (mini-boss room), Great Bay Temple (mini-boss room), and on a log in the river in the thawed Mountain Village. Once you've spoken to all of them, return to the Mountain Village pond and conduct the choir to get a Piece of Heart.", "found": false },
            { "id": "3ds-p-30", "location": "Road to Snowhead", "description": "Use the Scarecrow's Song, Hookshot, and Lens of Truth to reach a chest.", "walkthrough": "On the path to Snowhead, there's a large gap with two pillars. Play the Scarecrow's Song on the edge of the cliff. Use the Lens of Truth to see some invisible ice platforms. Jump across them and Hookshot to the scarecrow, then to the chest containing the Piece of Heart.", "found": false },
            { "id": "3ds-p-31", "location": "Goron Village", "description": "Trade the Swamp Title Deed to the Business Scrub and use the Deku Flower.", "walkthrough": "After getting the Swamp Title Deed, find the Business Scrub in Goron Village. As Deku Link, trade him the deed for the Mountain Title Deed. Use the Deku Flower he was on to fly to a ledge with a Piece of Heart.", "found": false },
            { "id": "3ds-p-32", "location": "Romani Ranch", "description": "Win 150 rupees or more at the dog races by using the Mask of Truth to pick a winning dog.", "walkthrough": "Go to the Doggy Racetrack at Romani Ranch. Wear the Mask of Truth to read the dogs' minds and pick the one that feels confident. Bet 50 rupees on it. If your dog wins and you get a payout of 150 rupees or more, you'll receive a Piece of Heart.", "found": false },
            { "id": "3ds-p-33", "location": "Oceanside Spider House", "description": "Clear the spider house of all 30 Gold Skulltulas.", "walkthrough": "On the Great Bay Coast, enter the Oceanside Spider House. You must find and kill all 30 Gold Skulltulas within the first day to break the curse. The man inside will give you a Piece of Heart as a reward.", "found": false },
            { "id": "3ds-p-34", "location": "Pinnacle Rock", "description": "Rescue the seahorse by taking a picture of a pirate and showing it to the fisherman. The seahorse will then guide you through Pinnacle Rock.", "walkthrough": "Get an empty bottle and go to the Pirates' Fortress. Take a picture of a Gerudo Pirate. Show the picture to the fisherman on the coast to get a seahorse. Take the seahorse to Pinnacle Rock. It will guide you through the murky water to a cave where two other seahorses are trapped. Defeat the Deep Pythons to free them, and they will give you a Piece of Heart.", "found": false },
            { "id": "3ds-p-35", "location": "Zora Cape", "description": "In the Zora Hall, play your ocarina for the Zora in Japas' room to have him write a song.", "walkthrough": "As Zora Link, go into Japas' room in the Zora Hall. He will start playing a bass riff. Pull out your ocarina and he will jam with you, creating a song. Play the song back to him. Then, go to Evan's room and play the same song as Link. Evan will be inspired and give you a Piece of Heart.", "found": false },
            { "id": "3ds-p-36", "location": "Zora Cape", "description": "In the Zora Game Site, catch all the fish.", "walkthrough": "Go to the Zora Game Site on the coast. Pay 20 rupees to play. You need to jump into the water and catch the two 'good' fish that the Zora throws in. They are the orange and blue ones. Bring them back to him to win a Piece of Heart.", "found": false },
            { "id": "3ds-p-37", "location": "Great Bay Coast", "description": "On the islands to the west, use the Hookshot to get to a chest.", "walkthrough": "On the western side of the Great Bay Coast, there are several small islands. Use the Hookshot to grapple from one palm tree to the next until you reach the island with a chest containing a Piece of Heart.", "found": false },
            { "id": "3ds-p-38", "location": "Pirate's Fortress", "description": "Get the Hookshot and use it to get to a chest in the main chamber.", "walkthrough": "Inside the main chamber of the Pirates' Fortress, there is a high ledge with a chest. You need the Hookshot to grapple onto a wooden beam and reach the chest, which contains a Piece of Heart.", "found": false },
            { "id": "3ds-p-39", "location": "Great Bay Coast", "description": "In the Beaver's Racetrack, beat both beavers twice.", "walkthrough": "Up the river in Zora Cape, you'll find the Beaver Racetrack. As Zora Link, you need to race and beat both beavers. After beating the first one, you get a bottle. Beat him again, and then his older brother will challenge you. Beat the older brother to get a Piece of Heart.", "found": false },
            { "id": "3ds-p-40", "location": "Zora Hall", "description": "Play the New Wave Bossa Nova to Lulu, then go to the Zora Hall and listen to the band members' soundcheck.", "walkthrough": "After you've learned the New Wave Bossa Nova and returned Lulu's voice, go to the Zora Hall. The band will be practicing. Listen to their soundcheck to get a Piece of Heart.", "found": false },
            { "id": "3ds-p-41", "location": "Great Bay Temple", "description": "Defeat the Gekko mini-boss.", "walkthrough": "Inside the Great Bay Temple, you will fight a Gekko mini-boss. Defeat it to reveal a chest containing a Piece of Heart.", "found": false },
            { "id": "3ds-p-42", "location": "Ikana Canyon", "description": "On the roof of Ikana Castle, shoot a switch and use the Deku Flowers to fly to a pillar.", "walkthrough": "Once you reach the roof of Ikana Castle, look for a crystal switch on a pillar. Shoot it with an arrow. This will extinguish the flames on another pillar, revealing a Deku Flower. Use the Deku Flowers to fly over to the pillar with the Piece of Heart.", "found": false },
            { "id": "3ds-p-43", "location": "Ancient Castle of Ikana", "description": "Hit a crystal switch in the throne room.", "walkthrough": "In the throne room of the Ancient Castle of Ikana, stand on one of the pillars and shoot the crystal switch on the other side of the room. This will cause a Piece of Heart to appear on the other pillar.", "found": false },
            { "id": "3ds-p-44", "location": "Stone Tower", "description": "On a ledge.", "walkthrough": "In the Stone Tower area, before you enter the temple, there is a series of ledges you can reach by using the Elegy of Emptiness to create statues to hold down switches. One of these ledges holds a Piece of Heart.", "found": false },
            { "id": "3ds-p-45", "location": "Secret Shrine", "description": "In a Secret Shrine, defeat the four bosses again.", "walkthrough": "In Ikana Canyon, there is a Secret Shrine that can only be accessed once you have 16 or more heart containers. Inside, you must fight the four main bosses again. Defeating them all will reward you with a Piece of Heart.", "found": false },
            { "id": "3ds-p-46", "location": "Ikana Canyon", "description": "Trade the Ocean Title Deed to the Business Scrub near Sakon's Hideout.", "walkthrough": "After getting the Ocean Title Deed from the Zora Hall, find the Business Scrub in Ikana Canyon near Sakon's Hideout. As Zora Link, trade him the deed for 200 rupees and the use of his Deku Flower. Use it to fly to a ledge with a Piece of Heart.", "found": false },
            { "id": "3ds-p-47", "location": "Ikana Graveyard", "description": "On the final night, have Dampe dig up the grave. The reward is a Piece of Heart instead of an Empty Bottle.", "walkthrough": "In the Ikana Graveyard on the final night, wear the Captain's Hat and order the Stalchildren to open the grave. Inside, lead Dampe through the tunnels. He will dig up a Piece of Heart.", "found": false },
            { "id": "3ds-p-48", "location": "The Moon", "description": "Complete the Deku Scrub mini-dungeon.", "walkthrough": "On the Moon, give one mask to the child wearing Odolwa's mask. Enter the Deku Scrub-themed dungeon and navigate the maze to the end to find a Piece of Heart.", "found": false },
            { "id": "3ds-p-49", "location": "The Moon", "description": "Complete the Goron mini-dungeon.", "walkthrough": "On the Moon, give two masks to the child wearing Goht's mask. Enter the Goron-themed dungeon and roll your way to the end to find a Piece of Heart.", "found": false },
            { "id": "3ds-p-50", "location": "The Moon", "description": "Complete the Zora mini-dungeon. The path is now Left, Right, Middle.", "walkthrough": "On the Moon, give three masks to the child wearing Gyorg's mask. Enter the Zora-themed dungeon. Swim through the currents in the correct sequence (Left, Right, Middle) to reach the end and find a Piece of Heart.", "found": false },
            { "id": "3ds-p-51", "location": "The Moon", "description": "Complete the Link mini-dungeon.", "walkthrough": "On the Moon, give four masks to the child wearing Twinmold's mask. Enter the Link-themed dungeon, which is a series of combat rooms. Defeat all the enemies to get a Piece of Heart.", "found": false }
        ]
    }
}